{
  "_name_or_path": "apple/deeplabv3-mobilevit-small",
  "architectures": [
    "MobileViTForSemanticSegmentation"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "id2label": {
    "0": "Background",
    "1": "Hat",
    "10": "Right-shoe",
    "11": "Face",
    "12": "Left-leg",
    "13": "Right-leg",
    "14": "Left-arm",
    "15": "Right-arm",
    "16": "Bag",
    "17": "Scarf",
    "2": "Hair",
    "3": "Sunglasses",
    "4": "Upper-clothes",
    "5": "Skirt",
    "6": "Pants",
    "7": "Dress",
    "8": "Belt",
    "9": "Left-shoe"
  },
  "image_size": 512,
  "initializer_range": 0.02,
  "label2id": {
    "Background": "0",
    "Bag": "16",
    "Belt": "8",
    "Dress": "7",
    "Face": "11",
    "Hair": "2",
    "Hat": "1",
    "Left-arm": "14",
    "Left-leg": "12",
    "Left-shoe": "9",
    "Pants": "6",
    "Right-arm": "15",
    "Right-leg": "13",
    "Right-shoe": "10",
    "Scarf": "17",
    "Skirt": "5",
    "Sunglasses": "3",
    "Upper-clothes": "4"
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 3,
  "output_stride": 16,
  "patch_size": 2,
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.46.2"
}
